In [1]:
# Import dependencies
import sqlite3
import pandas as pd

In [2]:
# Connect to database
conn = sqlite3.connect('database.sqlite')

# Player Count

In [3]:
# Read sqlite query results into a pandas DataFrame# Read  
player_count = pd.read_sql_query("""

SELECT 

COUNT(age) as 'Total Players'

FROM purchase_table

;

""",conn)

player_count.head()

   Total Players
0            858

# Purchasing Analysis (Total)

In [4]:
# Read sqlite query results into a pandas DataFrame# Read  
summary = pd.read_sql_query("""

SELECT 

DISTINCT(item_id) as 'Number of Unique Items',
AVG(price) as 'Average Price',
COUNT(item_id) as 'Number of Purchases',
SUM(price) as 'Total Revenue'

FROM purchase_table

;

""",conn)

summary.head()

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     134       2.930571                  858        2514.43

# Gender Demographics

In [5]:
# Read sqlite query results into a pandas DataFrame# Read  
gender_demographics = pd.read_sql_query("""

SELECT 

gender as 'Gender',

(COUNT(gender)*100)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',

COUNT(gender) as 'Total Count'

FROM purchase_table

GROUP BY gender

ORDER BY "Percentage of Players" DESC
;

""",conn)

gender_demographics.head()

                  Gender  Percentage of Players  Total Count
0                   Male              81.235431          697
1                 Female              17.365967          149
2  Other / Non-Disclosed               1.398601           12

# Purchasing Analysis (Gender)

In [6]:
# Read sqlite query results into a pandas DataFrame# Read  
gender_data = pd.read_sql_query("""

SELECT 

gender,
COUNT(gender) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

GROUP BY gender 
;

""",conn)

gender_data.head()

,gender,Purchase Count,Average Purchase Price,Total Purchase Value
0,Female,149,2.847584,424.29
1,Male,697,2.944448,2052.28
2,Other / Non-Disclosed,12,3.155000,37.86

# Age Demographics

In [7]:
# Read sqlite query results into a pandas DataFrame# Read  
age_demographics = pd.read_sql_query("""

SELECT 

'06 - 10' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age < 10

Union

SELECT 

'10 - 14' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age BETWEEN 10 and 14

Union

SELECT 

'15 - 19' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age BETWEEN 15 and 19

Union

SELECT 

'20 - 24' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age BETWEEN 20 and 24

Union

SELECT 

'25 - 29' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age BETWEEN 25 and 29

Union

SELECT 

'30 - 34' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age BETWEEN 30 and 34

Union

SELECT 

'35 - 39' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age BETWEEN 35 and 39

Union

SELECT 

'40+' as Age,
COUNT(gender)/(SELECT COUNT(age) FROM purchase_table) || '%' as 'Percentage of Players',
COUNT(gender) as 'Total Count'

FROM purchase_table

WHERE age > 40

;

""",conn)

age_demographics

       Age  Percentage of Players  Total Count
0  06 - 10               0.038462           33
1  10 - 14               0.044289           38
2  15 - 19               0.167832          144
3  20 - 24               0.433566          372
4  25 - 29               0.156177          134
5  30 - 34               0.082751           71
6  35 - 39               0.055944           48
7      40+               0.003497            3

# Purchasing Analysis (Age)

In [8]:
# Read sqlite query results into a pandas DataFrame# Read  
age_data = pd.read_sql_query("""

SELECT 

'06 - 10' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age < 10

Union

SELECT 

'10 - 14' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age BETWEEN 10 and 14

Union

SELECT 

'15 - 19' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age BETWEEN 15 and 19

Union

SELECT 

'20 - 24' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age BETWEEN 20 and 24

Union

SELECT 

'25 - 29' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age BETWEEN 25 and 29

Union

SELECT 

'30 - 34' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age BETWEEN 30 and 34

Union

SELECT 

'35 - 39' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age BETWEEN 35 and 39

Union

SELECT 

'40+' as Age,
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

WHERE age > 40

;

""",conn)

age_data

       Age  Purchase Count  Average Purchase Price  Total Purchase Value
0  06 - 10              33                2.947879                 97.28
1  10 - 14              38                2.787105                105.91
2  15 - 19             144                2.894653                416.83
3  20 - 24             372                2.923817               1087.66
4  25 - 29             134                2.958507                396.44
5  30 - 34              71                2.973803                211.14
6  35 - 39              48                2.932708                140.77
7      40+               3                2.880000                  8.64

# Top Spenders

In [9]:
# Read sqlite query results into a pandas DataFrame# Read  
top_spender = pd.read_sql_query("""

SELECT 

DISTINCT(sn) as 'SN',
COUNT(price) as 'Purchase Count',
AVG(price) as 'Average Purchase Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

GROUP BY sn
ORDER BY "Total Purchase Value" DESC
LIMIT 5
;

""",conn)

top_spender

              SN  Purchase Count  Average Purchase Price  Total Purchase Value
0    Undirrala66               5                   3.412                 17.06
1  Aerithllora36               4                   3.775                 15.10
2       Saedue76               4                   3.390                 13.56
3       Sondim43               4                   3.255                 13.02
4    Mindimnya67               4                   3.185                 12.74

# Most Popular Items

In [10]:
# Read sqlite query results into a pandas DataFrame# Read  
most_popular_items = pd.read_sql_query("""

SELECT 

item_iD as 'Item ID',
item_name as 'Item Name',
COUNT(item_iD) as 'Purchase Count',
price as 'Item Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

GROUP BY sn
ORDER BY "Purchase Count" DESC
LIMIT 5
;

""",conn)

most_popular_items

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,133,Faith's Scimitar,5,3.82,17.06
1,148,"Warmonger, Gift of Suffering's End",4,4.65,15.10
2,122,Unending Tyranny,4,1.21,5.87
3,104,Gladiator's Glaive,4,1.84,9.68
4,161,Devine,4,1.45,12.74

# Most Profitable Items

In [11]:
# Read sqlite query results into a pandas DataFrame# Read  
most_profitable_items = pd.read_sql_query("""

SELECT 

item_iD as 'Item ID',
item_name as 'Item Name',
COUNT(item_iD) as 'Purchase Count',
price as 'Item Price',
SUM(price) as 'Total Purchase Value'

FROM purchase_table

GROUP BY sn
ORDER BY "Total Purchase Value" DESC
LIMIT 5
;

""",conn)

most_profitable_items

,Item ID,Item Name,Purchase Count,Item Price,Total Purchase Value
0,133,Faith's Scimitar,5,3.82,17.06
1,148,"Warmonger, Gift of Suffering's End",4,4.65,15.10
2,73,Ritual Mace,4,3.74,13.56
3,94,Mourning Blade,4,3.64,13.02
4,161,Devine,4,1.45,12.74